*** crates/nix-ninja-task/src/patchelf.rs:132:5: replace retained_entries -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace retained_entries -> Vec<String> with vec!["xyzzy".into()]
@@ -124,21 +124,17 @@
 /// Empty entries go, because an empty element means the current directory and
 /// this function's output is written into a store binary - see parse_rpath.
 /// `$ORIGIN` entries go because the rewrite resolves them to store paths.
 ///
 /// Pulled out of compute_new_rpath so the rule is testable: that function
 /// shells out to patchelf against a real ELF, so nothing asserted on its
 /// output, which is exactly where the behaviour changed twice this week.
 fn retained_entries(current_rpath: &[String]) -> Vec<String> {
-    current_rpath
-        .iter()
-        .filter(|p| !p.is_empty() && !p.contains("$ORIGIN"))
-        .cloned()
-        .collect()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// The RPATH a rewritten output should carry, from what it had and the store
 /// directories its NEEDED libraries resolved to. `None` means nothing was
 /// added and the binary should be left alone.
 ///
 /// PURE, AND SEPARATE FROM THE ELF READING, so the retention rule can be
 /// pinned where it is actually applied. Nine tests covered `retained_entries`

---- a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs stdout ----

thread 'a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs' (16708) panicked at crates/nix-ninja/tests/rpath_assembly.rs:63:5:
assertion `left == right` failed
  left: ["xyzzy", "/nix/store/bbbb-zlib/lib"]
 right: ["/nix/store/bbbb-zlib/lib"]

---- nothing_new_means_leave_the_binary_alone stdout ----

thread 'nothing_new_means_leave_the_binary_alone' (16710) panicked at crates/nix-ninja/tests/rpath_assembly.rs:51:5:
assertion failed: assemble_rpath(&current, &needed).is_none()

failures:
    a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs
    nothing_new_means_leave_the_binary_alone

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
