*** crates/nix-ninja-task/src/patchelf.rs:15:5: replace fix_rpaths -> Result<()> with Ok(())

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace fix_rpaths -> Result<()> with Ok(())
@@ -7,33 +7,17 @@
 use std::process::Command;
 
 pub fn fix_rpaths(store_dir: &Path, outputs: &[DerivedFile]) -> Result<()> {
     // ONE LINE PER TASK, not per output. This printed a line for every ELF
     // it touched, and a task whose output is a tree (Qt's syncqt, cmake
     // custom targets) has hundreds - so the log of a link-heavy target was
     // mostly this message. The count is the part worth reading: it says how
     // many of the task's outputs were dynamic ELF at all.
-    let mut fixed = 0usize;
-    for output in outputs {
-        let canonical_path = fs::canonicalize(&output.build_path)
-            .map_err(|e| anyhow::anyhow!("canonicalize({}): {e}", output.build_path.display()))?;
-        if is_elf_dynamic(&canonical_path)? {
-            fix_rpath(store_dir, &canonical_path)?;
-            fixed += 1;
-        }
-    }
-    if fixed > 0 {
-        println!(
-            "nix-ninja-task: fixed RPATH on {fixed} of {} output(s)",
-            outputs.len()
-        );
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // Check if this is an executable or shared library that can have RPATH.
 // Skip object files (.o) or non-ELF files.
 fn is_elf_dynamic(path: &Path) -> Result<bool> {
     // A DIRECTORY OUTPUT IS NOT AN ELF AND READING ONE IS AN ERROR, not a
     // false. Since the driver can declare a whole tree as an output - the
     // syncqt include directory, whose contents ninja never names - this is

*** result: Success
