*** crates/nix-ninja-task/src/patchelf.rs:198:5: replace resolve_rpath -> Result<Vec<PathBuf>> with Ok(vec![Default::default()])

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace resolve_rpath -> Result<Vec<PathBuf>> with Ok(vec![Default::default()])
@@ -190,35 +190,17 @@
                 .to_owned(),
         );
     }
 
     Ok(assemble_rpath(current_rpath, &needed_dirs))
 }
 
 fn resolve_rpath(rpath: &[String], elf_path: &Path) -> Result<Vec<PathBuf>> {
-    let mut resolved_paths = Vec::new();
-
-    let origin = elf_path
-        .parent()
-        .ok_or_else(|| anyhow!("ELF path has no parent directory"))?
-        .to_string_lossy();
-
-    for entry in rpath {
-        // An empty entry is the runtime "current directory" marker. It is
-        // preserved in the rebuilt RPATH but it is not a directory we can
-        // resolve a needed library against here.
-        if entry.is_empty() {
-            continue;
-        }
-        let expanded = entry.replace("$ORIGIN", &origin);
-        resolved_paths.push(PathBuf::from(expanded));
-    }
-
-    Ok(resolved_paths)
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_needed_libs(elf_path: &Path) -> Result<Vec<String>> {
     let output = Command::new("patchelf")
         .arg("--print-needed")
         .arg(elf_path)
         .output()
         .map_err(|e| anyhow!("Failed to execute patchelf --print-needed: {e}"))?;

*** result: Success
