*** crates/nix-ninja-task/src/patchelf.rs:241:5: replace resolve_needed -> Result<Option<PathBuf>> with Ok(None)

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace resolve_needed -> Result<Option<PathBuf>> with Ok(None)
@@ -233,41 +233,17 @@
         .lines()
         .map(|line| line.trim().to_string())
         .filter(|line| !line.is_empty())
         .collect())
 }
 
 fn resolve_needed(lib_name: &str, rpath: &[PathBuf], store_dir: &Path) -> Result<Option<PathBuf>> {
     // Search for the library in each rpath directory
-    for search_dir in rpath {
-        let lib_path = search_dir.join(lib_name);
-
-        // If it's already in nix store, return None (don't add to rpath)
-        //
-        // PRE-EXISTING and untouched by this week's changes, flagged during
-        // the 2026-08-29 audit so it is on the record rather than rediscovered:
-        // this returns on the FIRST rpath entry that is store-prefixed,
-        // without checking the library actually exists there. For an rpath of
-        // `/nix/store/a/lib:/build/out/lib`, a library that lives only in the
-        // second entry is skipped. Not fixed here because nothing has been
-        // observed failing on it and a speculative change to rpath resolution
-        // is how this file acquired its last two defects.
-        if lib_path.starts_with(store_dir) {
-            return Ok(None);
-        }
-
-        if lib_path.exists() {
-            let canonical_path = fs::canonicalize(&lib_path)
-                .map_err(|e| anyhow::anyhow!("canonicalize({}): {e}", lib_path.display()))?;
-            return Ok(Some(canonical_path));
-        }
-    }
-
-    Err(anyhow!("Library {lib_name} not found in RPATH"))
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_rpath(elf_path: &Path, new_paths: &[String]) -> Result<()> {
     let rpath_str = new_paths.join(":");
     let mut cmd = Command::new("patchelf");
     cmd.arg("--set-rpath").arg(&rpath_str).arg(elf_path);
 
     let output = cmd

*** result: Success
