*** crates/nix-ninja-task/src/patchelf.rs:24:14: replace > with < in fix_rpaths

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace > with < in fix_rpaths
@@ -16,17 +16,17 @@
     for output in outputs {
         let canonical_path = fs::canonicalize(&output.build_path)
             .map_err(|e| anyhow::anyhow!("canonicalize({}): {e}", output.build_path.display()))?;
         if is_elf_dynamic(&canonical_path)? {
             fix_rpath(store_dir, &canonical_path)?;
             fixed += 1;
         }
     }
-    if fixed > 0 {
+    if fixed < /* ~ changed by cargo-mutants ~ */ 0 {
         println!(
             "nix-ninja-task: fixed RPATH on {fixed} of {} output(s)",
             outputs.len()
         );
     }
 
     Ok(())
 }

*** result: Success
