*** crates/nix-ninja-task/src/patchelf.rs:269:5: replace apply_rpath -> Result<()> with Ok(())

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace apply_rpath -> Result<()> with Ok(())
@@ -261,30 +261,17 @@
             return Ok(Some(canonical_path));
         }
     }
 
     Err(anyhow!("Library {lib_name} not found in RPATH"))
 }
 
 fn apply_rpath(elf_path: &Path, new_paths: &[String]) -> Result<()> {
-    let rpath_str = new_paths.join(":");
-    let mut cmd = Command::new("patchelf");
-    cmd.arg("--set-rpath").arg(&rpath_str).arg(elf_path);
-
-    let output = cmd
-        .output()
-        .map_err(|e| anyhow!("Failed to execute patchelf: {e}"))?;
-
-    if !output.status.success() {
-        let stderr = String::from_utf8_lossy(&output.stderr);
-        return Err(anyhow!("patchelf failed: {stderr}"));
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::{parse_rpath, retained_entries};
 
     // This file had no tests, which is why f8bb3bd shipped fixing one of the
     // three spellings of its own bug. These are the three.

*** result: Success
