*** crates/nix-ninja-task/src/patchelf.rs:106:5: replace get_raw_rpath -> Result<String> with Ok(String::new())

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace get_raw_rpath -> Result<String> with Ok(String::new())
@@ -98,30 +98,17 @@
         // element for a binary that has none.
         Vec::new()
     } else {
         raw.split(':').map(|s| s.to_string()).collect()
     }
 }
 
 fn get_raw_rpath(elf_path: &Path) -> Result<String> {
-    let output = Command::new("patchelf")
-        .arg("--print-rpath")
-        .arg(elf_path)
-        .output()
-        .map_err(|e| anyhow!("Failed to execute patchelf --print-rpath: {e}"))?;
-
-    if !output.status.success() {
-        let stderr = String::from_utf8_lossy(&output.stderr);
-        return Err(anyhow!("patchelf --print-rpath failed: {stderr}"));
-    }
-
-    Ok(String::from_utf8_lossy(&output.stdout)
-        .trim_end_matches('\n')
-        .to_string())
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The entries of an existing RPATH that survive into the rewritten one.
 ///
 /// Empty entries go, because an empty element means the current directory and
 /// this function's output is written into a store binary - see parse_rpath.
 /// `$ORIGIN` entries go because the rewrite resolves them to store paths.
 ///

*** result: Success
