*** crates/nix-ninja-task/src/patchelf.rs:134:35: replace && with || in retained_entries

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace && with || in retained_entries
@@ -126,17 +126,17 @@
 /// `$ORIGIN` entries go because the rewrite resolves them to store paths.
 ///
 /// Pulled out of compute_new_rpath so the rule is testable: that function
 /// shells out to patchelf against a real ELF, so nothing asserted on its
 /// output, which is exactly where the behaviour changed twice this week.
 fn retained_entries(current_rpath: &[String]) -> Vec<String> {
     current_rpath
         .iter()
-        .filter(|p| !p.is_empty() && !p.contains("$ORIGIN"))
+        .filter(|p| !p.is_empty() || /* ~ changed by cargo-mutants ~ */ !p.contains("$ORIGIN"))
         .cloned()
         .collect()
 }
 
 /// The RPATH a rewritten output should carry, from what it had and the store
 /// directories its NEEDED libraries resolved to. `None` means nothing was
 /// added and the binary should be left alone.
 ///

---- an_empty_entry_never_survives_assembly stdout ----

thread 'an_empty_entry_never_survives_assembly' (11930) panicked at crates/nix-ninja/tests/rpath_assembly.rs:31:5:
an empty RPATH element is a current-directory search: ["", "/build/source/build/lib", "$ORIGIN/../lib", "/nix/store/aaaa-glibc/lib"]

---- a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs stdout ----

thread 'a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs' (11929) panicked at crates/nix-ninja/tests/rpath_assembly.rs:63:5:
assertion `left == right` failed
  left: ["", "$ORIGIN", "/nix/store/bbbb-zlib/lib"]
 right: ["/nix/store/bbbb-zlib/lib"]

failures:
    a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs
    an_empty_entry_never_survives_assembly

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
