*** crates/nix-ninja-task/src/patchelf.rs:151:5: replace assemble_rpath -> Option<Vec<String>> with None

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace assemble_rpath -> Option<Vec<String>> with None
@@ -143,29 +143,17 @@
 /// PURE, AND SEPARATE FROM THE ELF READING, so the retention rule can be
 /// pinned where it is actually applied. Nine tests covered `retained_entries`
 /// in isolation and NOTHING covered the fact that this function calls it: a
 /// mutation replacing the call with `current_rpath.to_vec()` left the whole
 /// suite green while restoring the defect `f8bb3bd` fixed - an empty RPATH
 /// element, which the loader reads as the CURRENT DIRECTORY, written into a
 /// store output. The build succeeds and the artifact is wrong.
 pub fn assemble_rpath(current_rpath: &[String], needed_dirs: &[String]) -> Option<Vec<String>> {
-    let mut new_rpath = retained_entries(current_rpath);
-    let mut path_added = false;
-    for lib_str in needed_dirs {
-        if !new_rpath.contains(lib_str) {
-            new_rpath.push(lib_str.clone());
-            path_added = true;
-        }
-    }
-    if path_added {
-        Some(new_rpath)
-    } else {
-        None
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn compute_new_rpath(
     store_dir: &Path,
     elf_path: &Path,
     current_rpath: &[String],
 ) -> Result<Option<Vec<String>>> {
     // Resolve RPATH entries with $ORIGIN expansion

---- a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs stdout ----

thread 'a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs' (16500) panicked at crates/nix-ninja/tests/rpath_assembly.rs:62:49:
called `Option::unwrap()` on a `None` value

---- an_empty_entry_never_survives_assembly stdout ----

thread 'an_empty_entry_never_survives_assembly' (16501) panicked at crates/nix-ninja/tests/rpath_assembly.rs:29:49:
a new dir was added, so Some

failures:
    a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs
    an_empty_entry_never_survives_assembly

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
