*** crates/nix-ninja-task/src/patchelf.rs:154:12: delete ! in assemble_rpath

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ delete ! in assemble_rpath
@@ -146,17 +146,17 @@
 /// mutation replacing the call with `current_rpath.to_vec()` left the whole
 /// suite green while restoring the defect `f8bb3bd` fixed - an empty RPATH
 /// element, which the loader reads as the CURRENT DIRECTORY, written into a
 /// store output. The build succeeds and the artifact is wrong.
 pub fn assemble_rpath(current_rpath: &[String], needed_dirs: &[String]) -> Option<Vec<String>> {
     let mut new_rpath = retained_entries(current_rpath);
     let mut path_added = false;
     for lib_str in needed_dirs {
-        if !new_rpath.contains(lib_str) {
+        if  /* ~ changed by cargo-mutants ~ */new_rpath.contains(lib_str) {
             new_rpath.push(lib_str.clone());
             path_added = true;
         }
     }
     if path_added {
         Some(new_rpath)
     } else {
         None

---- a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs stdout ----

thread 'a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs' (3822) panicked at crates/nix-ninja/tests/rpath_assembly.rs:63:5:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["/nix/store/bbbb-zlib/lib"]

---- an_empty_entry_never_survives_assembly stdout ----

thread 'an_empty_entry_never_survives_assembly' (3823) panicked at crates/nix-ninja/tests/rpath_assembly.rs:39:5:
the resolved library directory must be kept: ["xyzzy"]

---- nothing_new_means_leave_the_binary_alone stdout ----

thread 'nothing_new_means_leave_the_binary_alone' (3824) panicked at crates/nix-ninja/tests/rpath_assembly.rs:51:5:
assertion failed: assemble_rpath(&current, &needed).is_none()

failures:
    a_binary_whose_only_entries_are_dropped_still_gains_what_it_needs
    an_empty_entry_never_survives_assembly
    nothing_new_means_leave_the_binary_alone

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
