*** crates/nix-ninja-task/src/patchelf.rs:235:24: delete ! in get_needed_libs

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ delete ! in get_needed_libs
@@ -227,17 +227,17 @@
         let stderr = String::from_utf8_lossy(&output.stderr);
         return Err(anyhow!("patchelf --print-needed failed: {stderr}"));
     }
 
     let needed_str = String::from_utf8_lossy(&output.stdout);
     Ok(needed_str
         .lines()
         .map(|line| line.trim().to_string())
-        .filter(|line| !line.is_empty())
+        .filter(|line|  /* ~ changed by cargo-mutants ~ */line.is_empty())
         .collect())
 }
 
 fn resolve_needed(lib_name: &str, rpath: &[PathBuf], store_dir: &Path) -> Result<Option<PathBuf>> {
     // Search for the library in each rpath directory
     for search_dir in rpath {
         let lib_path = search_dir.join(lib_name);

*** result: Success
