*** crates/nix-ninja-task/src/patchelf.rs:45:5: replace is_elf_dynamic -> Result<bool> with Ok(true)

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace is_elf_dynamic -> Result<bool> with Ok(true)
@@ -37,32 +37,17 @@
     // A DIRECTORY OUTPUT IS NOT AN ELF AND READING ONE IS AN ERROR, not a
     // false. Since the driver can declare a whole tree as an output - the
     // syncqt include directory, whose contents ninja never names - this is
     // reached with a directory, and `fs::read` returns EISDIR:
     //     Error: read(.../include/QtSvg): Is a directory
     // which fails the task rather than skipping the entry. Nothing inside an
     // include tree carries an RPATH; a directory output that does would need
     // a walk here, and there is no such output today.
-    if path.is_dir() {
-        return Ok(false);
-    }
-    let data = fs::read(path).map_err(|e| anyhow::anyhow!("read({}): {e}", path.display()))?;
-
-    let elf = match ElfBytes::<AnyEndian>::minimal_parse(&data) {
-        Ok(elf) => elf,
-        Err(_) => return Ok(false), // Not a valid ELF file
-    };
-
-    // Only process executables (ET_EXEC) and shared libraries (ET_DYN)
-    // Skip object files (ET_REL) as they don't have RPATH
-    match elf.ehdr.e_type {
-        elf::abi::ET_EXEC | elf::abi::ET_DYN => Ok(true),
-        _ => Ok(false),
-    }
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn fix_rpath(store_dir: &Path, elf_path: &Path) -> Result<()> {
     // One `patchelf --print-rpath` per file. This used to be two: fix_rpath
     // read the raw string to spot a trailing colon and compute_new_rpath read
     // it again through a near-identical helper. This function runs over every
     // output of every task derivation, so the second one was a subprocess per
     // output across a whole distribution.

*** result: Success
