*** crates/nix-ninja-task/src/patchelf.rs:69:5: replace fix_rpath -> Result<()> with Ok(())

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace fix_rpath -> Result<()> with Ok(())
@@ -61,21 +61,17 @@
 }
 
 fn fix_rpath(store_dir: &Path, elf_path: &Path) -> Result<()> {
     // One `patchelf --print-rpath` per file. This used to be two: fix_rpath
     // read the raw string to spot a trailing colon and compute_new_rpath read
     // it again through a near-identical helper. This function runs over every
     // output of every task derivation, so the second one was a subprocess per
     // output across a whole distribution.
-    let current_rpath = parse_rpath(&get_raw_rpath(elf_path)?);
-    if let Some(new_rpath) = compute_new_rpath(store_dir, elf_path, &current_rpath)? {
-        apply_rpath(elf_path, &new_rpath)?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Split a raw RPATH on ':', PRESERVING empty entries.
 ///
 /// Faithful on the READ side so callers can see what the binary actually
 /// carries. `compute_new_rpath` then drops empties when it rebuilds, and that
 /// asymmetry is the whole point.
 ///

*** result: Success
