*** crates/nix-ninja-task/src/patchelf.rs:96:5: replace parse_rpath -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/nix-ninja-task/src/patchelf.rs
+++ replace parse_rpath -> Vec<String> with vec!["xyzzy".into()]
@@ -88,23 +88,17 @@
 ///
 /// This function exists to rewrite build-time paths into store paths, so a
 /// build-directory decision is precisely the thing that must not survive it.
 /// `f8bb3bd` argued the opposite - that the trailing empty entry was
 /// "meaningful" and should be re-appended - and that reasoning was wrong in a
 /// way that put a cwd search into every patched output. The original splitter
 /// dropped every empty entry, and on the write side it was right to.
 fn parse_rpath(raw: &str) -> Vec<String> {
-    if raw.is_empty() {
-        // "".split(':') yields one empty entry, which would invent an RPATH
-        // element for a binary that has none.
-        Vec::new()
-    } else {
-        raw.split(':').map(|s| s.to_string()).collect()
-    }
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_raw_rpath(elf_path: &Path) -> Result<String> {
     let output = Command::new("patchelf")
         .arg("--print-rpath")
         .arg(elf_path)
         .output()
         .map_err(|e| anyhow!("Failed to execute patchelf --print-rpath: {e}"))?;

---- patchelf::tests::an_empty_entry_never_survives_into_a_store_binary stdout ----

thread 'patchelf::tests::an_empty_entry_never_survives_into_a_store_binary' (31149) panicked at crates/nix-ninja-task/src/patchelf.rs:319:9:
assertion `left == right` failed: read side stays faithful
  left: ["xyzzy"]
 right: ["", "/a", "/b"]

---- patchelf::tests::a_lone_colon_is_two_empty_entries stdout ----

thread 'patchelf::tests::a_lone_colon_is_two_empty_entries' (31148) panicked at crates/nix-ninja-task/src/patchelf.rs:308:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["", ""]

---- patchelf::tests::interior_empty_entry_survives_in_place stdout ----

thread 'patchelf::tests::interior_empty_entry_survives_in_place' (31150) panicked at crates/nix-ninja-task/src/patchelf.rs:298:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["/a", "", "/b"]

failures:
    patchelf::tests::a_lone_colon_is_two_empty_entries
    patchelf::tests::an_empty_entry_never_survives_into_a_store_binary
    patchelf::tests::interior_empty_entry_survives_in_place
    patchelf::tests::leading_empty_entry_survives
    patchelf::tests::no_rpath_is_no_entries_not_one_empty_entry
    patchelf::tests::ordinary_rpath_is_unchanged
    patchelf::tests::origin_entries_are_dropped_because_the_rewrite_resolves_them
    patchelf::tests::trailing_and_interior_empties_go_too
    patchelf::tests::trailing_empty_entry_survives

test result: FAILED. 3 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
